Sound_Swap/app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
    def index
        playlist = Playlist.all