Sound_Swap/app/controllers/songs_controller.rb

    def index
        song = Song.all
---
SELECT "songs".* FROM "songs"

    def create
        song = @current_user.songs.create!(song_params)
---
INSERT INTO "songs" ("title", "artist", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "LOVE"], ["artist", "Sofiane Pamart"], ["duration", "257"], ["created_at", "2022-01-27 20:00:24.759246"], ["updated_at", "2022-01-27 20:00:24.759246"]]

    def destroy
        song = find_by_id
        song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 222]]

    def find_by_id
        Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 222], ["LIMIT", 1]]