Sound_Swap/app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "123"], ["password_digest", "$2a$12$WgTdHuQVbBgnUQTsj0q7Qeiqq9IW7yvDTArsL15hTzjNqfYVuBfDa"], ["created_at", "2022-01-27 19:21:45.055035"], ["updated_at", "2022-01-27 19:21:45.055035"]]